INSERT INTO breakfast_snack
(name, season, region, suitable_meal, suitable_people, avoid_people, is_canteen_suitable)
VALUES
('温泉蛋', '四季', '通用', '早餐', '普通职工,学生', '蛋白过敏及老人儿童慎用', 0),
('燕麦鸡蛋饼', '四季', '通用', '早餐', '普通职工,学生,老人', '蛋白过敏及控糖人群适量', 1),
('意式香肠北非蛋', '四季', '通用', '早餐', '普通职工,学生', '高血压,高血脂及蛋白过敏人群慎用', 0),
('蒸花卷', '四季', '华北,东北,通用', '早餐', '普通职工,学生,老人,体力劳动者', '控糖人群适量', 1),
('蒸水蛋', '四季', '通用', '早餐,午餐,晚餐', '普通职工,学生,老人', '蛋白过敏人群慎用', 1);


INSERT INTO aquatic_dish
(name, season, region, suitable_meal, suitable_people, avoid_people, is_canteen_suitable)
VALUES
('响油鳝丝', '夏,秋,四季', '江浙,华东,通用', '午餐,晚餐', '普通职工,学生', '鱼类过敏及高尿酸人群慎用', 1),
('小龙虾', '夏', '江浙,华中,华东,通用', '午餐,晚餐', '普通职工,学生', '甲壳类过敏及高尿酸人群慎用', 0),
('阳朔啤酒鱼', '夏,秋,四季', '广西,华南,通用', '午餐,晚餐', '普通职工,学生,体力劳动者', '鱼类过敏及高尿酸人群慎用', 1),
('油焖大虾', '夏,秋,四季', '湖北,江浙,通用', '午餐,晚餐', '普通职工,学生', '海鲜过敏及高尿酸人群慎用', 1);


INSERT INTO meat_dish
(name, season, region, suitable_meal, suitable_people, avoid_people, is_canteen_suitable)
VALUES
('柱候牛腩', '秋,冬,四季', '粤菜,华南,通用', '午餐,晚餐', '普通职工,学生,体力劳动者', '高尿酸及高血脂人群适量', 1),
('孜然牛肉', '四季', '西北,通用', '午餐,晚餐', '普通职工,学生,体力劳动者', '高尿酸及胃肠敏感人群适量', 1),
('淄博烧烤', '夏,四季', '山东,华北,通用', '午餐,晚餐', '普通职工,学生', '高血脂及高血压人群慎用', 0),
('醉排骨', '四季', '福建,通用', '午餐,晚餐', '普通职工,学生', '控糖及高血脂人群慎用', 1);


INSERT INTO soup_porridge
(name, season, region, suitable_meal, suitable_people, avoid_people, is_canteen_suitable)
VALUES
('昂刺鱼豆腐汤', '春,夏,秋,四季', '江浙,华东,通用', '午餐,晚餐', '普通职工,学生,老人', '高尿酸及鱼类过敏人群慎用', 1),
('朱雀汤', '四季', '通用', '午餐,晚餐', '普通职工,学生', '特殊食材不明，过敏人群慎用', 0),
('紫菜蛋花汤', '四季', '通用', '午餐,晚餐', '普通职工,学生,老人', '蛋白过敏及高尿酸人群慎用', 1);


INSERT INTO staple_food
(name, season, region, suitable_meal, suitable_people, avoid_people, is_canteen_suitable)
VALUES
('炒方便面', '四季', '通用', '午餐,晚餐', '普通职工,学生', '高血压及控油人群慎用', 1),
('中式馅饼', '四季', '华北,东北,通用', '早餐,午餐,晚餐', '普通职工,学生', '高血脂及控糖人群适量', 1),
('猪油拌饭', '四季', '江浙,通用', '午餐,晚餐', '普通职工,学生,体力劳动者', '高血脂及高血压人群慎用', 1),
('煮泡面加蛋', '四季', '通用', '早餐,午餐,晚餐', '普通职工,学生', '高血压及蛋白过敏人群慎用', 1);


INSERT INTO vegetable_dish
(name, season, region, suitable_meal, suitable_people, avoid_people, is_canteen_suitable)
VALUES
('拔丝土豆', '四季', '通用', '午餐,晚餐', '普通职工,学生', '控糖人群慎用', 1),
('印度土豆花菜', '四季', '通用', '午餐,晚餐', '普通职工,学生', '胃肠敏感人群慎用', 1),
('油醋爆蛋', '四季', '通用', '午餐,晚餐', '普通职工,学生', '蛋白过敏人群慎用', 1);